app/controllers/products_controller.rb

  def create
    @product = Product.create product_params
---
INSERT INTO "products" ("title", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "知識王"], ["description", "還不錯玩的遊戲拉"], ["price", 100], ["created_at", "2018-02-20 02:20:13.997458"], ["updated_at", "2018-02-20 02:20:13.997458"]]

  def update
    @product.update_attributes!(product_params)
---
UPDATE "products" SET "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["description", "這是七龍珠的商品"], ["updated_at", "2018-02-20 02:19:52.743343"], ["id", 1]]

  def destroy
    @product.destroy!
---
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 2]]

  def find_product
    @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]